; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-4-8-46)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	truck7 - truck
	truck8 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	package31 - package
	package32 - package
	package33 - package
	package34 - package
	package35 - package
	package36 - package
	package37 - package
	package38 - package
	package39 - package
	package40 - package
	package41 - package
	package42 - package
	package43 - package
	package44 - package
	package45 - package
	package46 - package
	s0 - location
	s1 - location
	s2 - location
	p0-2 - location
	p1-0 - location
	p2-1 - location
	)
	(:init
	(at driver1 s0)
	(at driver2 s2)
	(at driver3 s2)
	(at driver4 s0)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s1)
	(empty truck2)
	(at truck3 s0)
	(empty truck3)
	(at truck4 s0)
	(empty truck4)
	(at truck5 s2)
	(empty truck5)
	(at truck6 s1)
	(empty truck6)
	(at truck7 s1)
	(empty truck7)
	(at truck8 s0)
	(empty truck8)
	(at package1 s0)
	(at package2 s2)
	(at package3 s2)
	(at package4 s2)
	(at package5 s1)
	(at package6 s1)
	(at package7 s0)
	(at package8 s0)
	(at package9 s1)
	(at package10 s1)
	(at package11 s0)
	(at package12 s1)
	(at package13 s2)
	(at package14 s1)
	(at package15 s1)
	(at package16 s0)
	(at package17 s0)
	(at package18 s2)
	(at package19 s2)
	(at package20 s2)
	(at package21 s1)
	(at package22 s0)
	(at package23 s0)
	(at package24 s1)
	(at package25 s0)
	(at package26 s2)
	(at package27 s1)
	(at package28 s0)
	(at package29 s0)
	(at package30 s0)
	(at package31 s1)
	(at package32 s0)
	(at package33 s0)
	(at package34 s0)
	(at package35 s0)
	(at package36 s1)
	(at package37 s2)
	(at package38 s2)
	(at package39 s2)
	(at package40 s2)
	(at package41 s1)
	(at package42 s1)
	(at package43 s0)
	(at package44 s2)
	(at package45 s0)
	(at package46 s0)
	(path s0 p0-2)
	(path p0-2 s0)
	(path s2 p0-2)
	(path p0-2 s2)
	(path s1 p1-0)
	(path p1-0 s1)
	(path s0 p1-0)
	(path p1-0 s0)
	(path s2 p2-1)
	(path p2-1 s2)
	(path s1 p2-1)
	(path p2-1 s1)
	(link s0 s1)
	(link s1 s0)
	(link s0 s2)
	(link s2 s0)
	(link s2 s1)
	(link s1 s2)
)
	(:goal (and
	(at driver1 s0)
	(at driver2 s1)
	(at driver3 s1)
	(at driver4 s0)
	(at truck2 s0)
	(at truck3 s2)
	(at truck4 s0)
	(at truck8 s1)
	(at package1 s0)
	(at package2 s0)
	(at package3 s0)
	(at package4 s2)
	(at package5 s2)
	(at package7 s2)
	(at package8 s1)
	(at package9 s2)
	(at package10 s0)
	(at package11 s1)
	(at package13 s0)
	(at package14 s2)
	(at package15 s1)
	(at package16 s2)
	(at package17 s2)
	(at package18 s0)
	(at package19 s1)
	(at package20 s0)
	(at package21 s0)
	(at package22 s1)
	(at package25 s0)
	(at package26 s1)
	(at package27 s2)
	(at package28 s1)
	(at package29 s1)
	(at package30 s0)
	(at package31 s2)
	(at package32 s2)
	(at package33 s0)
	(at package34 s1)
	(at package35 s2)
	(at package36 s1)
	(at package37 s0)
	(at package38 s0)
	(at package39 s1)
	(at package40 s1)
	(at package41 s0)
	(at package42 s0)
	(at package44 s0)
	(at package45 s1)
	(at package46 s2)
	))


)

; plan
1. (board-truck driver2 s2 truck1)
   deleted: (at driver2 s2) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 10 of 49
2. (load-truck s2 package44 truck1)
   deleted: (at package44 s2)
   added: (in package44 truck1)
   goals met: 10 of 49
3. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 10 of 49
4. (load-truck s0 package8 truck1)
   deleted: (at package8 s0)
   added: (in package8 truck1)
   goals met: 10 of 49
5. (load-truck s0 package7 truck1)
   deleted: (at package7 s0)
   added: (in package7 truck1)
   goals met: 10 of 49
6. (load-truck s0 package46 truck1)
   deleted: (at package46 s0)
   added: (in package46 truck1)
   goals met: 10 of 49
7. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 10 of 49
8. (drive-truck driver2 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 10 of 49
9. (unload-truck s2 package7 truck1)
   deleted: (in package7 truck1)
   added: (at package7 s2)
   goals met: 11 of 49
10. (unload-truck s2 package46 truck1)
   deleted: (in package46 truck1)
   added: (at package46 s2)
   goals met: 12 of 49
11. (drive-truck driver2 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 12 of 49
12. (load-truck s1 package9 truck1)
   deleted: (at package9 s1)
   added: (in package9 truck1)
   goals met: 12 of 49
13. (drive-truck driver2 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 12 of 49
14. (unload-truck s2 package9 truck1)
   deleted: (in package9 truck1)
   added: (at package9 s2)
   goals met: 13 of 49
15. (load-truck s2 package40 truck1)
   deleted: (at package40 s2)
   added: (in package40 truck1)
   goals met: 13 of 49
16. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 13 of 49
17. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 13 of 49
18. (unload-truck s1 package8 truck1)
   deleted: (in package8 truck1)
   added: (at package8 s1)
   goals met: 14 of 49
19. (load-truck s1 package5 truck1)
   deleted: (at package5 s1)
   added: (in package5 truck1)
   goals met: 14 of 49
20. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 14 of 49
21. (load-truck s0 package45 truck1)
   deleted: (at package45 s0)
   added: (in package45 truck1)
   goals met: 14 of 49
22. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 14 of 49
23. (unload-truck s1 package45 truck1)
   deleted: (in package45 truck1)
   added: (at package45 s1)
   goals met: 15 of 49
24. (drive-truck driver2 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 15 of 49
25. (unload-truck s2 package5 truck1)
   deleted: (in package5 truck1)
   added: (at package5 s2)
   goals met: 16 of 49
26. (load-truck s2 package39 truck1)
   deleted: (at package39 s2)
   added: (in package39 truck1)
   goals met: 16 of 49
27. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 16 of 49
28. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 16 of 49
29. (load-truck s1 package42 truck1)
   deleted: (at package42 s1)
   added: (in package42 truck1)
   goals met: 16 of 49
30. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 16 of 49
31. (unload-truck s0 package44 truck1)
   deleted: (in package44 truck1)
   added: (at package44 s0)
   goals met: 17 of 49
32. (unload-truck s0 package42 truck1)
   deleted: (in package42 truck1)
   added: (at package42 s0)
   goals met: 18 of 49
33. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 18 of 49
34. (load-truck s1 package41 truck1)
   deleted: (at package41 s1)
   added: (in package41 truck1)
   goals met: 18 of 49
35. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 18 of 49
36. (unload-truck s0 package41 truck1)
   deleted: (in package41 truck1)
   added: (at package41 s0)
   goals met: 19 of 49
37. (load-truck s0 package35 truck1)
   deleted: (at package35 s0)
   added: (in package35 truck1)
   goals met: 19 of 49
38. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 19 of 49
39. (drive-truck driver2 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 19 of 49
40. (load-truck s2 package38 truck1)
   deleted: (at package38 s2)
   added: (in package38 truck1)
   goals met: 19 of 49
41. (load-truck s2 package37 truck1)
   deleted: (at package37 s2)
   added: (in package37 truck1)
   goals met: 19 of 49
42. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 19 of 49
43. (unload-truck s0 package38 truck1)
   deleted: (in package38 truck1)
   added: (at package38 s0)
   goals met: 20 of 49
44. (unload-truck s0 package37 truck1)
   deleted: (in package37 truck1)
   added: (at package37 s0)
   goals met: 21 of 49
45. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 21 of 49
46. (unload-truck s1 package40 truck1)
   deleted: (in package40 truck1)
   added: (at package40 s1)
   goals met: 22 of 49
47. (unload-truck s1 package39 truck1)
   deleted: (in package39 truck1)
   added: (at package39 s1)
   goals met: 23 of 49
48. (drive-truck driver2 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 23 of 49
49. (unload-truck s2 package35 truck1)
   deleted: (in package35 truck1)
   added: (at package35 s2)
   goals met: 24 of 49
50. (load-truck s2 package3 truck1)
   deleted: (at package3 s2)
   added: (in package3 truck1)
   goals met: 24 of 49
51. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 24 of 49
52. (load-truck s0 package34 truck1)
   deleted: (at package34 s0)
   added: (in package34 truck1)
   goals met: 24 of 49
53. (load-truck s0 package32 truck1)
   deleted: (at package32 s0)
   added: (in package32 truck1)
   goals met: 24 of 49
54. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 24 of 49
55. (unload-truck s1 package34 truck1)
   deleted: (in package34 truck1)
   added: (at package34 s1)
   goals met: 25 of 49
56. (load-truck s1 package31 truck1)
   deleted: (at package31 s1)
   added: (in package31 truck1)
   goals met: 25 of 49
57. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 25 of 49
58. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 25 of 49
59. (unload-truck s2 package32 truck1)
   deleted: (in package32 truck1)
   added: (at package32 s2)
   goals met: 26 of 49
60. (unload-truck s2 package31 truck1)
   deleted: (in package31 truck1)
   added: (at package31 s2)
   goals met: 27 of 49
61. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 27 of 49
62. (unload-truck s0 package3 truck1)
   deleted: (in package3 truck1)
   added: (at package3 s0)
   goals met: 28 of 49
63. (load-truck s0 package29 truck1)
   deleted: (at package29 s0)
   added: (in package29 truck1)
   goals met: 28 of 49
64. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 28 of 49
65. (unload-truck s1 package29 truck1)
   deleted: (in package29 truck1)
   added: (at package29 s1)
   goals met: 29 of 49
66. (load-truck s1 package27 truck1)
   deleted: (at package27 s1)
   added: (in package27 truck1)
   goals met: 29 of 49
67. (drive-truck driver2 s1 s2 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s2)
   goals met: 29 of 49
68. (unload-truck s2 package27 truck1)
   deleted: (in package27 truck1)
   added: (at package27 s2)
   goals met: 30 of 49
69. (load-truck s2 package26 truck1)
   deleted: (at package26 s2)
   added: (in package26 truck1)
   goals met: 30 of 49
70. (drive-truck driver2 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 30 of 49
71. (unload-truck s1 package26 truck1)
   deleted: (in package26 truck1)
   added: (at package26 s1)
   goals met: 31 of 49
72. (load-truck s1 package21 truck1)
   deleted: (at package21 s1)
   added: (in package21 truck1)
   goals met: 31 of 49
73. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 31 of 49
74. (load-truck s0 package28 truck1)
   deleted: (at package28 s0)
   added: (in package28 truck1)
   goals met: 31 of 49
75. (load-truck s0 package22 truck1)
   deleted: (at package22 s0)
   added: (in package22 truck1)
   goals met: 31 of 49
76. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 31 of 49
77. (unload-truck s1 package28 truck1)
   deleted: (in package28 truck1)
   added: (at package28 s1)
   goals met: 32 of 49
78. (unload-truck s1 package22 truck1)
   deleted: (in package22 truck1)
   added: (at package22 s1)
   goals met: 33 of 49
79. (load-truck s1 package14 truck1)
   deleted: (at package14 s1)
   added: (in package14 truck1)
   goals met: 33 of 49
80. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 33 of 49
81. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 33 of 49
82. (load-truck s2 package20 truck1)
   deleted: (at package20 s2)
   added: (in package20 truck1)
   goals met: 33 of 49
83. (load-truck s2 package2 truck1)
   deleted: (at package2 s2)
   added: (in package2 truck1)
   goals met: 33 of 49
84. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 33 of 49
85. (unload-truck s0 package21 truck1)
   deleted: (in package21 truck1)
   added: (at package21 s0)
   goals met: 34 of 49
86. (unload-truck s0 package20 truck1)
   deleted: (in package20 truck1)
   added: (at package20 s0)
   goals met: 35 of 49
87. (unload-truck s0 package2 truck1)
   deleted: (in package2 truck1)
   added: (at package2 s0)
   goals met: 36 of 49
88. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 36 of 49
89. (load-truck s2 package19 truck1)
   deleted: (at package19 s2)
   added: (in package19 truck1)
   goals met: 36 of 49
90. (drive-truck driver2 s2 s1 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s1)
   goals met: 36 of 49
91. (unload-truck s1 package19 truck1)
   deleted: (in package19 truck1)
   added: (at package19 s1)
   goals met: 37 of 49
92. (load-truck s1 package10 truck1)
   deleted: (at package10 s1)
   added: (in package10 truck1)
   goals met: 37 of 49
93. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 37 of 49
94. (load-truck s0 package17 truck1)
   deleted: (at package17 s0)
   added: (in package17 truck1)
   goals met: 37 of 49
95. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 37 of 49
96. (load-truck s2 package18 truck1)
   deleted: (at package18 s2)
   added: (in package18 truck1)
   goals met: 37 of 49
97. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 37 of 49
98. (unload-truck s0 package18 truck1)
   deleted: (in package18 truck1)
   added: (at package18 s0)
   goals met: 38 of 49
99. (load-truck s0 package16 truck1)
   deleted: (at package16 s0)
   added: (in package16 truck1)
   goals met: 38 of 49
100. (drive-truck driver2 s0 s2 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s2)
   goals met: 38 of 49
101. (unload-truck s2 package17 truck1)
   deleted: (in package17 truck1)
   added: (at package17 s2)
   goals met: 39 of 49
102. (unload-truck s2 package16 truck1)
   deleted: (in package16 truck1)
   added: (at package16 s2)
   goals met: 40 of 49
103. (unload-truck s2 package14 truck1)
   deleted: (in package14 truck1)
   added: (at package14 s2)
   goals met: 41 of 49
104. (drive-truck driver2 s2 s0 truck1)
   deleted: (at truck1 s2)
   added: (at truck1 s0)
   goals met: 41 of 49
105. (load-truck s0 package11 truck1)
   deleted: (at package11 s0)
   added: (in package11 truck1)
   goals met: 41 of 49
106. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 41 of 49
107. (disembark-truck driver2 s1 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 42 of 49
108. (unload-truck s1 package11 truck1)
   deleted: (in package11 truck1)
   added: (at package11 s1)
   goals met: 43 of 49
109. (load-truck s2 package13 truck5)
   deleted: (at package13 s2)
   added: (in package13 truck5)
   goals met: 43 of 49
110. (board-truck driver3 s2 truck5)
   deleted: (at driver3 s2) (empty truck5)
   added: (driving driver3 truck5)
   goals met: 43 of 49
111. (drive-truck driver3 s2 s0 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   goals met: 43 of 49
112. (unload-truck s0 package13 truck5)
   deleted: (in package13 truck5)
   added: (at package13 s0)
   goals met: 44 of 49
113. (drive-truck driver3 s0 s1 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   goals met: 44 of 49
114. (board-truck driver4 s0 truck8)
   deleted: (at driver4 s0) (empty truck8)
   added: (driving driver4 truck8)
   goals met: 43 of 49
115. (drive-truck driver4 s0 s1 truck8)
   deleted: (at truck8 s0)
   added: (at truck8 s1)
   goals met: 44 of 49
116. (board-truck driver2 s1 truck1)
   deleted: (at driver2 s1) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 43 of 49
117. (disembark-truck driver4 s1 truck8)
   deleted: (driving driver4 truck8)
   added: (at driver4 s1) (empty truck8)
   goals met: 43 of 49
118. (disembark-truck driver3 s1 truck5)
   deleted: (driving driver3 truck5)
   added: (at driver3 s1) (empty truck5)
   goals met: 44 of 49
119. (board-truck driver4 s1 truck2)
   deleted: (at driver4 s1) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 44 of 49
120. (drive-truck driver4 s1 s0 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s0)
   goals met: 45 of 49
121. (disembark-truck driver4 s0 truck2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s0) (empty truck2)
   goals met: 46 of 49
122. (drive-truck driver2 s1 s0 truck1)
   deleted: (at truck1 s1)
   added: (at truck1 s0)
   goals met: 46 of 49
123. (unload-truck s0 package10 truck1)
   deleted: (in package10 truck1)
   added: (at package10 s0)
   goals met: 47 of 49
124. (drive-truck driver2 s0 s1 truck1)
   deleted: (at truck1 s0)
   added: (at truck1 s1)
   goals met: 47 of 49
125. (disembark-truck driver2 s1 truck1)
   deleted: (driving driver2 truck1)
   added: (at driver2 s1) (empty truck1)
   goals met: 48 of 49
126. (board-truck driver4 s0 truck3)
   deleted: (at driver4 s0) (empty truck3)
   added: (driving driver4 truck3)
   goals met: 47 of 49
127. (drive-truck driver4 s0 s2 truck3)
   deleted: (at truck3 s0)
   added: (at truck3 s2)
   goals met: 48 of 49
128. (disembark-truck driver4 s2 truck3)
   deleted: (driving driver4 truck3)
   added: (at driver4 s2) (empty truck3)
   goals met: 48 of 49
129. (walk driver4 s2 p0-2)
   deleted: (at driver4 s2)
   added: (at driver4 p0-2)
   goals met: 48 of 49
130. (walk driver4 p0-2 s0)
   deleted: (at driver4 p0-2)
   added: (at driver4 s0)
   goals met: 49 of 49
